literate-elisp.org
# -*- encoding:utf-8 Mode: POLY-ORG; org-src-preserve-indentation: t; -*- ---
#+TITLE:  Emacs Lisp literate library
#+SubTitle: a literate programming tool to write Emacs lisp codes in org mode.
#+OPTIONS: toc:2
#+Startup: noindent
#+LATEX_HEADER: % copied from lstlang1.sty, to add new language support to Emacs Lisp.
#+LATEX_HEADER: \lstdefinelanguage{elisp}[]{lisp} {}
#+LATEX_HEADER: \lstloadlanguages{elisp}
#+PROPERTY: header-args :results silent
#+PROPERTY: literate-lang elisp
#+PROPERTY: literate-load yes

* Table of Contents                                            :TOC:noexport:
- [[#introduction][Introduction]]
- [[#how-to-do-it][How to do it?]]
- [[#implementation][Implementation]]
  - [[#preparation][Preparation]]
  - [[#stream-read-functions][stream read functions]]
  - [[#handle-org-mode-syntax][handle org mode syntax]]
  - [[#loadcompile-org-file-with-new-syntax][load/compile org file with new syntax]]
  - [[#compatibility-with-other-libraries][compatibility with other libraries]]
  - [[#function-to-tangle-org-file-to-emacs-lisp-file][function to tangle org file to Emacs Lisp file]]
- [[#release-current-library][Release current library]]
- [[#how-to-insert-code-block-in-org-file][How to insert code block in org file]]
- [[#tests][Tests]]
  - [[#introduction-1][Introduction]]
  - [[#test-cases][test cases]]
- [[#references][References]]

* Introduction

An Emacs library or configuration file can write in org mode then tangle to an Emacs Lisp file later,
here is one example: [[https://github.com/larstvei/dot-emacs][Emacs configurations written in Org mode]].

But What if I want to write a library or a configuration file in org file and load it to Emacs directly?
If it can, then we will have a uniform development environment without keeping multiple copies
of codes. Furthermore, we can jump to the Emacs Lisp definition in an org file directly when required.
That will be a convenient way for our daily development.

So is this library, which extends the Emacs [[https://www.gnu.org/software/emacs/manual/html_node/elisp/How-Programs-Do-Loading.html#How-Programs-Do-Loading][load]] mechanism so Emacs can load org files as lisp source files directly.

* How to do it?
In org mode, the Emacs lisp codes surround by lines between ~#+begin_src elisp~ and ~#+end_src~
(see [[https://orgmode.org/manual/Literal-examples.html][org manual]]).

#+BEGIN_EXAMPLE
   ,#+BEGIN_SRC elisp :load no
   (message "this is a test.~%")
   ,#+END_SRC
#+END_EXAMPLE

So to let Emacs lisp can read an org file directly, all lines out of surrounding
by ~#+begin_src elisp~ and ~#+end_src~ should mean nothing,
and even codes surrounding by them should mean nothing
if the [[https://orgmode.org/manual/Code-block-specific-header-arguments.html#Code-block-specific-header-arguments][header arguments]] in a code block request such behavior.

Here is a trick, a new Emacs lisp reader function get implemented
(by binding Emacs Lisp variable [[https://www.gnu.org/software/emacs/manual/html_node/elisp/How-Programs-Do-Loading.html][load-read-function]]) to replace original ~read~ function when
using Emacs Lisp function ~load~ to load an org file.

The new reader will make Emacs Lisp reader enter into org mode syntax,
which means it will ignore all lines until it meet ~#+BEGIN_SRC elisp~.

When ~#+begin_src elisp~ occur, [[https://orgmode.org/manual/Code-block-specific-header-arguments.html#Code-block-specific-header-arguments][header arguments]] for this code block will give us
a chance to switch back to normal Emacs lisp reader or not.

And if it switches back to normal Emacs lisp reader, the end line ~#+END_SRC~ should mean the
end of current code block, if it occurs, then the reader will switch back to org mode syntax.
If not, then the reader will continue to read subsequent stream
as like the original Emacs lisp reader.

* Implementation
** Preparation

We use common lisp macros, along with ~ob-core~ and ~subr-x~ functions, in this library
#+BEGIN_SRC elisp
(require 'cl-lib)
(require 'ob-core)
(require 'subr-x)
#+END_SRC

There is a debug variable to switch on/off the log messages for this library.
#+BEGIN_SRC elisp
(defvar literate-elisp-debug-p nil)
#+END_SRC
So we can use print debug meesage with this function:
#+BEGIN_SRC elisp
(defun literate-elisp-debug (format-string &rest args)
  "Print debug messages if switch is on.
Argument FORMAT-STRING: same argument of Emacs function `message',
Argument ARGS: same argument of Emacs function `message'."
  (when literate-elisp-debug-p
    (apply 'message format-string args)))
#+END_SRC


There is also a dynamic Boolean variable bounded by our read function while parsing is in progress.
It'll indicate whether org mode syntax or Emacs Lisp mode syntax is in use.
#+BEGIN_SRC elisp
(defvar literate-elisp-org-code-blocks-p nil)
#+END_SRC

And the code block begin/end identifiers:
#+BEGIN_SRC elisp
(defvar literate-elisp-begin-src-id "#+BEGIN_SRC")
(defvar literate-elisp-end-src-id "#+END_SRC")
(defvar literate-elisp-lang-ids (list "elisp" "emacs-lisp"))
#+END_SRC

This library uses ~alist-get~, which was first implemented in Emacs 25.1.
#+BEGIN_SRC elisp
(unless (fboundp 'alist-get)
  (defun alist-get (key alist)
    "A minimal definition of `alist-get', for compatibility with Emacs < 25.1"
    (let ((x (assq key alist)))
      (when x (cdr x)))))
#+END_SRC

** stream read functions
To give us the ability of syntax analysis,
stream read actions such as ~peek a character~ or ~read and drop next character~ should get implemented.

The [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Input-Streams.html#Input-Streams][input streams]] are the same streams used by the original Emacs Lisp [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Input-Functions.html#Input-Functions][read]] function.
*** literate-elisp-peek
#+BEGIN_SRC elisp
(defun literate-elisp-peek (in)
  "Return the next character without dropping it from the stream.
Argument IN: input stream."
  (cond ((bufferp in)
         (with-current-buffer in
           (when (not (eobp))
             (char-after))))
        ((markerp in)
         (with-current-buffer (marker-buffer in)
           (when (< (marker-position in) (point-max))
             (char-after in))))
        ((functionp in)
         (let ((c (funcall in)))
           (when c
             (funcall in c))
           c))))
#+END_SRC
*** literate-elisp-next
#+BEGIN_SRC elisp
(defun literate-elisp-next (in)
  "Given a stream function, return and discard the next character.
Argument IN: input stream."
  (cond ((bufferp in)
         (with-current-buffer in
           (when (not (eobp))
             (prog1
               (char-after)
               (forward-char 1)))))
        ((markerp in)
         (with-current-buffer (marker-buffer in)
           (when (< (marker-position in) (point-max))
             (prog1
               (char-after in)
               (forward-char 1)))))
        ((functionp in)
         (funcall in))))
#+END_SRC
*** literate-elisp-position
This functions is a helpful function to debug our library.
#+BEGIN_SRC elisp
(defun literate-elisp-position (in)
  "Return the current position from the stream.
Argument IN: input stream."
  (cond ((bufferp in)
         (with-current-buffer in
           (point)))
        ((markerp in)
         (with-current-buffer (marker-buffer in)
           (marker-position in)))
        ((functionp in)
         "Unknown")))
#+END_SRC

*** literate-elisp-read-until-end-of-line
when read org file character by character, if current line determines as an org syntax,
then the whole line should ignore, so there should exist such a function.

Before then, let's implement an abstract method to ~read characters repeatly while a predicate matches~.

The ignored string return from this function
because it may be useful sometimes, for example when reading [[https://orgmode.org/manual/Code-block-specific-header-arguments.html#Code-block-specific-header-arguments][header arguments]] after ~#+begin_src elisp~.
#+BEGIN_SRC elisp
(defun literate-elisp-read-while (in pred)
  "Read and return a string from the input stream, as long as the predicate.
Argument IN: input stream.
Argument PRED: predicate function."
  (let ((chars (list)) ch)
    (while (and (setq ch (literate-elisp-peek in))
                (funcall pred ch))
      (push (literate-elisp-next in) chars))
    (apply #'string (nreverse chars))))
#+END_SRC

Now reading until end of line is easy to implement.
#+BEGIN_SRC elisp
(defun literate-elisp-read-until-end-of-line (in)
  "Skip over a line (move to `end-of-line').
Argument IN: input stream."
  (prog1
    (literate-elisp-read-while in (lambda (ch)
                              (not (eq ch ?\n))))
    (literate-elisp-next in)))
#+END_SRC
** handle org mode syntax
