literate-elisp.org
*** code block header argument ~load~
There are a lot of different Emacs Lisp codes occur in one org file, some for function implementation,
some for demo, and some for test, so an [[https://orgmode.org/manual/Structure-of-code-blocks.html][org code block]] [[https://orgmode.org/manual/Code-block-specific-header-arguments.html#Code-block-specific-header-arguments][header argument]] ~load~ to decide to
read them or not should define, and it has the following meanings:
- yes \\
  It means that current code block should load normally,
  it is the default mode when the header argument ~load~ is not provided.
- no \\
  It means that current code block should ignore by Emacs Lisp reader.
- test \\
  It means that current code block should load only when variable ~literate-elisp-test-p~ is true.
  #+BEGIN_SRC elisp
(defvar literate-elisp-test-p nil)
  #+END_SRC

Now let's implement above rule.
#+BEGIN_SRC elisp
(defun literate-elisp-load-p (flag)
  "Load current elisp code block or not.
Argument FLAG: flag symbol."
  (cl-case flag
    ((yes nil) t)
    (test literate-elisp-test-p)
    (no nil)
    (t nil)))
#+END_SRC

Let's also implement a function to read [[https://orgmode.org/manual/Code-block-specific-header-arguments.html#Code-block-specific-header-arguments][header arguments]] after ~#+BEGIN_SRC elisp~,
and convert every key and value to a Emacs Lisp symbol(test is here:ref:test-literate-elisp-read-header-arguments).
#+BEGIN_SRC elisp
(defun literate-elisp-read-header-arguments (arguments)
  "Reading org code block header arguments as an alist.
Argument ARGUMENTS: a string to hold the arguments."
  (org-babel-parse-header-arguments (string-trim arguments)))
#+END_SRC

Let's define a convenient function to get load flag from the input stream.
#+BEGIN_SRC elisp
(defun literate-elisp-get-load-option (in)
  "Read load option from input stream.
Argument IN: input stream."
  (let ((rtn (alist-get :load
                        (literate-elisp-read-header-arguments
                         (literate-elisp-read-until-end-of-line in)))))
    (when (stringp rtn)
      (intern rtn))))
#+END_SRC


*** handle prefix spaces.
Sometimes ~#+begin_src elisp~ and ~#+end_src~ may have prefix spaces,
let's ignore them carefully.

If it is not processed correctly, the reader may enter into an infinite loop, especially when using a custom reader to tangle codes.
#+BEGIN_SRC elisp
(defun literate-elisp-ignore-white-space (in)
  "Skip white space characters.
Argument IN: input stream."
  (while (cl-find (literate-elisp-peek in) '(?\n ?\ ?\t))
    ;; discard current character.
    (literate-elisp-next in)))
#+END_SRC

*** alternative Emacs Lisp read function
When tangling org file, we want to tangle Emacs Lisp codes without changing them(but Emacs original ~read~ will),
so let's define a variable to hold the actual Emacs Lisp reader used by us
then it can be changed when tangling org files(see ref:literate-elisp-tangle-reader).
#+BEGIN_SRC elisp
(defvar literate-elisp-emacs-read (symbol-function 'read))
#+END_SRC
We don't use the original symbol ~read~ in ~literate-elisp-read~ because sometimes function ~read~ can be changed by the following Emacs Lisp code
#+BEGIN_SRC elisp :load no
(fset 'read (symbol-function 'literate-elisp-read-internal))
#+END_SRC
So we can ensure that ~literate-elisp-emacs-read~ will always use the original ~read~ function, which will not be altered when we want to byte compile
the org file by function ~literate-elisp-byte-compile-file~.

*** basic read routine for org mode syntax.
It's time to implement the main routine to read literate org file.
The basic idea is simple, ignoring all lines out of Emacs Lisp source block,
and be careful about the special character ~#~.

On the other side, Emacs original ~read~ function will try to skip all comments until
it can get a valid Emacs Lisp form, so when we call original ~read~ function and
there are no valid Emacs Lisp form left in one code block,
it may reach ~#+end_src~, but we can't determine whether the original ~read~ function
arrive there after a complete parsing or incomplete parsing, to avoid such condition,
we will filter all comments out to ensure original ~read~ can always have a form to read.

#+BEGIN_SRC elisp
(defun literate-elisp-read-datum (in)
  "Read and return a Lisp datum from the input stream.
Argument IN: input stream."

  (literate-elisp-ignore-white-space in)
  (let ((ch (literate-elisp-peek in)))
    (literate-elisp-debug "literate-elisp-read-datum to character '%c'(position:%s)."
                          ch (literate-elisp-position in))

    (cond
      ((not ch)
       (signal 'end-of-file nil))
      ((or (and (not literate-elisp-org-code-blocks-p)
                (not (eq ch ?\#)))
           (eq ch ?\;))
       (let ((line (literate-elisp-read-until-end-of-line in)))
         (literate-elisp-debug "ignore line %s" line))
       nil)
      ((eq ch ?\#)
       (literate-elisp-next in)
       (literate-elisp-read-after-sharpsign in))
      (t
       (literate-elisp-debug "enter into original Emacs read.")
       (funcall literate-elisp-emacs-read in)))))
#+END_SRC
*** how to handle when meet ~#~

We have to be careful when meeting the character ~#~ and handle different conditions that may occur:
#+BEGIN_SRC elisp
(defun literate-elisp-read-after-sharpsign (in)
  "Read after #.
Argument IN: input stream."
  ;;     if it is not inside an Emacs Lisp syntax
  (cond ((not literate-elisp-org-code-blocks-p)
         ;; check if it is `#+begin_src'
         (if (or (cl-loop for i from 1 below (length literate-elisp-begin-src-id)
                          for c1 = (aref literate-elisp-begin-src-id i)
                          for c2 = (literate-elisp-next in)
                          with case-fold-search = t
                          thereis (not (char-equal c1 c2)))
                 (while (memq (literate-elisp-peek in) '(?\s ?\t))
                   (literate-elisp-next in)) ; skip tabs and spaces, return nil
                 ;; followed by `elisp' or `emacs-lisp'
                 (cl-loop with lang = ; this inner loop grabs the language specifier
                          (cl-loop while (not (memq (literate-elisp-peek in) '(?\s ?\t ?\n)))
                                   with rtn
                                   collect (literate-elisp-next in) into rtn
                                   finally return (apply 'string rtn))
                          for id in literate-elisp-lang-ids
                          never (string-equal (downcase lang) id)))
           ;; if it is not, continue to use org syntax and ignore this line
           (progn (literate-elisp-read-until-end-of-line in)
                  nil)
           ;; if it is, read source block header arguments for this code block and check if it should be loaded.
           (cond ((literate-elisp-load-p (literate-elisp-get-load-option in))
                  ;; if it should be loaded, switch to Emacs Lisp syntax context
                  (literate-elisp-debug "enter into a Emacs Lisp code block")
                  (setf literate-elisp-org-code-blocks-p t)
                  nil)
                 (t
                  ;; if it should not be loaded, continue to use org syntax and ignore this line
                 nil))))
        (t
        ;; 2. if it is inside an Emacs Lisp syntax
         (let ((c (literate-elisp-next in)))
           (literate-elisp-debug "found #%c inside an org block" c)
           (cl-case c
             ;; check if it is ~#+~, which has only legal meaning when it is equal `#+end_src'
             (?\+
              (let ((line (literate-elisp-read-until-end-of-line in)))
                (literate-elisp-debug "found org Emacs Lisp end block:%s" line))
             ;; if it is, then switch to org mode syntax.
              (setf literate-elisp-org-code-blocks-p nil)
              nil)
             ;; if it is not, then use original Emacs Lisp reader to read the following stream
             (t (funcall literate-elisp-emacs-read in)))))))
#+END_SRC
** load/compile org file with new syntax
*** literate reader is in use when loading an org file

Original function ~read~ will read until it can get a valid lisp form,
we will try to keep this behavior.
#+BEGIN_SRC elisp
(defun literate-elisp-read-internal (&optional in)
  "A wrapper to follow the behavior of original read function.
Argument IN: input stream."
  (cl-loop for form = (literate-elisp-read-datum in)
        if form
          do (cl-return form)
             ;; if original read function return nil, just return it.
        if literate-elisp-org-code-blocks-p
          do (cl-return nil)
             ;; if it reaches end of stream.
        if (null (literate-elisp-peek in))
          do (cl-return nil)))
#+END_SRC

label:literate-elisp-read
Now we define the literate read function which will bind to Emacs variable [[https://www.gnu.org/software/emacs/manual/html_node/elisp/How-Programs-Do-Loading.html][load-read-function]].
#+BEGIN_SRC elisp
(defun literate-elisp-read (&optional in)
  "Literate read function.
Argument IN: input stream."
  (if (and load-file-name
           (string-match "\\.org\\'" load-file-name))
    (literate-elisp-read-internal in)
    (read in)))
#+END_SRC

And the main exported function to do literate load.
#+BEGIN_SRC elisp
(defun literate-elisp-load (path)
  "Literate load function.
Argument PATH: target file to load."
  (let ((load-read-function (symbol-function 'literate-elisp-read))
        (literate-elisp-org-code-blocks-p nil))
    (load path)))
#+END_SRC

If you want to literate load file in batch mode, here it is:
#+BEGIN_SRC elisp
(defun literate-elisp-batch-load ()
  "Literate load file in `command-line' arguments."
  (or noninteractive
      (signal 'user-error '("This function is only for use in batch mode")))
  (if command-line-args-left
    (literate-elisp-load (pop command-line-args-left))
    (error "No argument left for `literate-elisp-batch-load'")))
#+END_SRC

