literate-elisp.org
** function to tangle org file to Emacs Lisp file
To build an Emacs lisp file from an org file without depending on ~literate-elisp~ library,
we need tangle an org file to an Emacs lisp file(.el).

Firstly, when tangle Emacs Lisp codes, we don't want to use original Emacs ~read~ function to read them because it will ignore comment lines
and it's hard for us to revert them back to a pretty print code, so we define a new reader function and bind it to
variable ~literate-elisp-read~.

This reader will read codes in a code block without changing them until it reach ~#+end_src~.

label:literate-elisp-tangle-reader
#+BEGIN_SRC elisp
(defun literate-elisp-tangle-reader (&optional buf)
  "Tangling codes in one code block.
Argument BUF: source buffer."
  (with-output-to-string
      (with-current-buffer buf
        (when (not (string-blank-p
                    (buffer-substring (line-beginning-position)
                                      (point))))
          ;; if reader still in last line, move it to next line.
          (forward-line 1))

        (loop for line = (buffer-substring-no-properties (line-beginning-position) (line-end-position))
              until (or (eobp)
                        (string-equal (string-trim (downcase line)) "#+end_src"))
              do (loop for c across line
                       do (write-char c))
                 (literate-elisp-debug "tangle Emacs Lisp line %s" line)
                 (write-char ?\n)
                 (forward-line 1)))))
#+END_SRC

Now we can tangle the Emacs Lisp code blocks with the following codes.
#+BEGIN_SRC elisp
(cl-defun literate-elisp-tangle (&optional (file (or org-src-source-file-name (buffer-file-name)))
                                 &key (el-file (concat (file-name-sans-extension file) ".el"))
                                header tail
                                test-p)
  "Tangle org file to elisp file.
Argument FILE: target file.
Optional argument EL-FILE .
Optional argument HEADER .
Optional argument TAIL .
Optional argument TEST-P ."
  (interactive)
  (let* ((source-buffer (find-file-noselect file))
         (target-buffer (find-file-noselect el-file))
         (org-path-name (concat (file-name-base file) "." (file-name-extension file)))
         (literate-elisp-emacs-read 'literate-elisp-tangle-reader)
         (literate-elisp-test-p test-p)
         (literate-elisp-org-code-blocks-p nil))
    (with-current-buffer target-buffer
      (delete-region (point-min) (point-max))
      (when header
        (insert header "\n"))
      (insert ";;; Code:\n\n"
              ";; The code is automatically generated by function `literate-elisp-tangle' from file `" org-path-name "'.\n"
              ";; It is not designed to be readable by a human.\n"
              ";; It is generated to load by Emacs directly without depending on `literate-elisp'.\n"
              ";; you should read file `" org-path-name "' to find out the usage and implementation detail of this source file.\n\n"
              "\n"))

    (with-current-buffer source-buffer
      (save-excursion
        (goto-char (point-min))
        (cl-loop for obj = (literate-elisp-read-internal source-buffer)
                 if obj
                 do (with-current-buffer target-buffer
                      (insert obj "\n"))
                 until (eobp))))

    (with-current-buffer target-buffer
      (when tail
        (insert "\n" tail))
      (save-buffer)
      (kill-current-buffer))))
#+END_SRC
* Release current library
And when a new version of [[./literate-elisp.el]] can release from this file,
the following code should execute.
#+BEGIN_SRC elisp :load no
(literate-elisp-tangle
 "literate-elisp.org"
 :header ";;; literate-elisp.el --- A library to write Emacs Lisp codes in org mode  -*- lexical-binding: t; -*-

;; Copyright (C) 2018-2019 Jingtao Xu

;; Author: Jingtao Xu <jingtaozf@gmail.com>
;; Created: 6 Dec 2018
;; Version: 0.1
;; Keywords: lisp docs extensions tools
;; URL: https://github.com/jingtaozf/literate-elisp
;; Package-Requires: ((cl-lib \"0.6\") (emacs \"26.1\"))

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.

;;; Commentary:

;; Literate-elisp is an Emacs Lisp library to provide an easy way to use literate programming in Emacs Lisp.
;; It extends the Emacs load mechanism so Emacs can load Org files as Lisp source files directly.
"
                 :tail "(provide 'literate-elisp)
;;; literate-elisp.el ends here
")
#+END_SRC
The head and tail lines require by [[https://github.com/melpa/melpa/blob/master/CONTRIBUTING.org][MELPA]] repository.

Now let's check the Emacs Lisp file to meet the requirement of [[https://github.com/melpa/melpa/blob/master/CONTRIBUTING.org][MELPA]].
#+BEGIN_SRC elisp :load no
(require 'package-lint)
(with-current-buffer (find-file "literate-elisp.el")
  (checkdoc)
  (package-lint-current-buffer))
#+END_SRC

* How to insert code block in org file
There are various ways to do it, for example you can extend the org mode's [[https://orgmode.org/manual/Easy-templates.html][Easy templates]] to fit your needs.

I wrote a small Emacs interactive command so it can insert header arguments based on current [[https://orgmode.org/manual/Property-syntax.html][org properties]] automatically.
Because properties can be inherited from parent sections or whole file scope, so different default value of header arguments can be used.

Let's define a language list we want to support
#+BEGIN_SRC elisp
(defvar literate-elisp-language-candidates
    '("lisp" "elisp" "axiom" "spad" "python" "C" "sh" "java" "js" "clojure" "clojurescript" "C++" "css"
      "calc" "asymptote" "dot" "gnuplot" "ledger" "lilypond" "mscgen"
      "octave" "oz" "plantuml" "R" "sass" "screen" "sql" "awk" "ditaa"
      "haskell" "latex" "lisp" "matlab" "ocaml" "org" "perl" "ruby"
      "scheme" "sqlite"))
#+END_SRC

Let's determine the current literate language before inserting a code block
#+BEGIN_SRC elisp
(defun literate-elisp-get-language-to-insert ()
  "Determine the current literate language before inserting a code block."
  (or (org-entry-get (point) "literate-lang" t) ;get it from an org property at current point.
      ;; get it from a candidates list.
      (completing-read "Source Code Language: " literate-elisp-language-candidates)))
#+END_SRC
So you can define org property ~literate-lang~ in a file scope like this in the beginning of an org file
#+BEGIN_EXAMPLE
#+PROPERTY: literate-lang elisp
#+END_EXAMPLE
Or define it in a separate org section with a different default value
#+BEGIN_EXAMPLE
This is a section for another literate language
:PROPERTIES:
:literate-lang: lisp
:END:
#+END_EXAMPLE

Let's define the valid load types for a code block
#+BEGIN_SRC elisp
(defvar literate-elisp-valid-load-types '("yes" "no" "test"))
#+END_SRC

Let's determine the current literate load type before inserting a code block
#+BEGIN_SRC elisp
(defun literate-elisp-get-load-type-to-insert ()
  "Determine the current literate load type before inserting a code block."
  (or (org-entry-get (point) "literate-load" t) ;get it from an org property at current point.
      (completing-read "Source Code Load Type: " literate-elisp-valid-load-types)))
#+END_SRC
So you can define org property ~literate-load~ in a file scope like this in the beginning of org file
#+BEGIN_EXAMPLE
#+PROPERTY: literate-load yes
#+END_EXAMPLE
Or define it in a separate org section with a different default value, for example for demo section
#+BEGIN_EXAMPLE
This is a demo section so don't load codes inside it
#+PROPERTY:
:PROPERTIES:
:literate-load: no
:END:
#+END_EXAMPLE

Now it's time to implement the insert command
#+BEGIN_SRC elisp
(defun literate-elisp-insert-org-src-block ()
  "Insert the source code block in `org-mode'."
  (interactive)
  (let ((lang (literate-elisp-get-language-to-insert))
        (load-type (literate-elisp-get-load-type-to-insert)))
    (when lang
      (insert (format "#+BEGIN_SRC %s" lang)
              (if (or (null load-type) (string= "yes" load-type))
                ""
                (format " :load %s" load-type))
              "\n")
      (newline)
      (insert "#+END_SRC\n")
      (forward-line -2))))
#+END_SRC

You can bind this command to a global key in Emacs like this
#+BEGIN_SRC elisp :load no
(global-set-key [f2] 'literate-elisp-insert-org-src-block)
#+END_SRC

* Tests
** Introduction
We use [[https://www.gnu.org/software/emacs/manual/html_node/ert/Introduction.html#Introduction][ERT]] library to define and run tests.
Web service [[https://travis-ci.com/jingtaozf/literate-lisp][travis ci]] will load config file [[./.travis.yml]] to run these tests automatically
every time there is a new git change.
** test cases
*** test the empty code block
label:test-empty-code-block
If one code block is empty, we will use Emacs original ~read~ function, which will read ~#+end_src~
and signal an error, let's test whether ~literate-elisp~ can read it gracefully.
#+BEGIN_SRC elisp :load test

#+END_SRC

#+BEGIN_SRC elisp :load test
;; This is a comment line to test empty code block.
#+END_SRC
*** test code block with prefix space.
Some code blocks have white spaces before ~#+begin_src elisp~, let's test whether ~literate-elisp~ can read it normally.
  #+BEGIN_SRC elisp :load test
(defvar literate-elisp-a-test-variable 10)
  #+END_SRC

Let's write a test case for above code block.
#+BEGIN_SRC elisp :load test
(ert-deftest literate-elisp-read-code-block-with-prefix-space ()
  "A spec of code block with prefix space."
  (should (equal literate-elisp-a-test-variable 10)))
#+END_SRC

*** test code block with lowercase block delimiters
Some code blocks have ~#+begin_src elisp~ and ~#+end_src~ in lowercase; let's test whether ~literate-elisp~ can match it case-insensitively.
#+begin_src elisp :load test
(defvar literate-elisp-test-variable-2 20)
#+end_src

Let's write a test case for above code block.
#+BEGIN_SRC elisp :load test
(ert-deftest literate-elisp-read-lowercase-code-block ()
  "A spec of code block with lowercase block delimiters."
  (should (equal literate-elisp-test-variable-2 20)))
#+END_SRC

*** test code block with ~emacs-lisp~ instead of ~elisp~
Some code blocks use ~emacs-lisp~ instead of the shortened ~elisp~ as the language specifier; let's test if ~literate-elisp-read-after-sharpsign~ matches it properly.
#+BEGIN_SRC emacs-lisp :load test
(defvar literate-elisp-test-variable-3 30)
#+END_SRC

Let's write a test case for the above code block.
#+BEGIN_SRC elisp :load test
(ert-deftest literate-elisp-read-block-with-lang-emacs-lisp ()
  "A spec of code block with the language specifier `emacs-lisp'
instead of `elisp'."
  (should (equal literate-elisp-test-variable-3 30)))
#+END_SRC

